{
  "Recipes" : [
    {
      "id": "0001",
      "title": "Eggless Cakes",
      "ingredients": ["Flour", "Milk", "Baking powder", "Baking soda", "Cocoa", "Butter"],
      "preptime": "2 Hours",
      "description": "Eggless chocolate cake recipe with video & step by step photos – This simple moist, soft chocolate cake has no butter, no eggs, no milk in it except for the frosting which uses little butter & milk. This cake is made with almost very basic ingredients and is popularly known as wacky cake or depression cake.",
      "url":"https://www.youtube.com/watch?v=PmqdA05OXuI"
    }, {
      "id": "0002",
      "title": "CupCakes",
      "ingredients": ["Flour", "Milk", "Baking powder", "Baking soda", "Cocoa", "Butter", "Eggs"],
      "preptime": "1 Hours",
      "description": "Moist, perfect cupcakes everyone will love. Recipes with photos and reviews for vanilla cupcakes, cupcake frosting, mini cupcakes and more.",
      "url":"https://www.youtube.com/watch?v=kdkU0kn7yZI"
    }, {
      "id": "0003",
      "title": "Pastries",
      "ingredients": ["Flour", "Milk", "Baking powder", "Baking soda", "Cocoa", "Butter", "Eggs"],
      "preptime": "30 Minutes",
      "description": "Pastry, stiff dough made from flour, salt, a relatively high proportion of fat, and a small proportion of liquid. It may also contain sugar or flavourings. Most pastry is leavened only by the action of steam, but Danish pastry is raised with yeast. Pastry is rolled or patted out into thin sheets to line pie or tart pans and to enclose fillings. Poultry, tenderloin of beef and other cuts of meat, and pâtés are sometimes prepared en croûte, wrapped in a pastry crust. Thicker sheets may be formed into cases, pinwheels, crescents, or braids, with or without fillings and glazes or icings.",
      "url":"https://www.youtube.com/watch?v=UrF11axPgB4"
    }, {
      "id": "0004",
      "title": "Paneer Butter Masala",
      "ingredients": ["Paneer", "Butter", "Indian spices", "Onion", "Tomatoes"],
      "preptime": "2 Hours",
      "description": "Paneer butter masala recipe – Learn how to make the best restaurant style paneer butter masala at home. Paneer butter masala is one of the most popular vegetarian dishes from Indian cuisine. Isn’t it fun to recreate restaurant style dishes at home? I found this best paneer butter masala recipe years ago in one of the cookbooks in a library. I tried it and then made this for years and my entire family got hooked to this dish.",
      "url":"https://www.youtube.com/watch?v=pjJgCXx_FRk"
    }, {
      "id": "0005",
      "title": "Paneer Tikka Masala",
      "ingredients": ["Paneer", "Butter", "Indian spices", "Onion", "Tomatoes", "Capsicum"],
      "preptime": "30 Minutes",
      "description": "Paneer tikka masala is a delicious, creamy & flavorful dish made by grilling paneer & then adding it to a masala gravy. Paneer refers to Indian cottage cheese, tikka is a small chunk of grilled food and masala here refers to a spiced gravy. So paneer tikka masala literally translates to grilled chunks of Indian cheese in spicy gravy.",
      "url":"https://www.youtube.com/watch?v=UrF11axPgB4"
    }, {
      "id": "0006",
      "title": "Paneer Kadhai",
      "ingredients": ["Paneer", "Butter", "Indian spices", "Onion", "Tomatoes", "Capsicum"],
      "preptime": "30 Minutes",
      "description": "Kadai paneer recipe – Indian cottage cheese or paneer cooked in onion tomato gravy with kadai masala. This dish gets its name karahi or kadhai paneer since it is cooked in a special Indian wok called kadai which is one of the most basic kitchen essentials of Indian Cuisine.",
      "url":"https://www.youtube.com/watch?v=vPyabMwHR28"
    }, {
      "id": "0007",
      "title": "Ceaser Salad",
      "ingredients": ["Romaine lettuce", "Cheese", "Crisp croutons", "Chicken"],
      "preptime": "45 Minutes",
      "description": "Classic Caesar Salad with crisp homemade croutons and a light caesar dressing – for when you want to impress your dinner guests.",
      "url":"https://www.youtube.com/watch?v=llr-GVo_NnI"
    }, {
      "id": "0008",
      "title": "Sandwich",
      "ingredients": ["Bread Slices", "Butter", "Onion", "Tomatoes", "Coriander", "Cheese"],
      "preptime": "2 Hours",
      "description": "One of the famous street food of Maharashtra, Bombay Grilled Sandwich is an interesting sandwich recipe and is quite spicy in taste. You'll definitely enjoy this tiffin recipe.",
      "url":"https://www.youtube.com/watch?v=W3puT_mZTvc"
    }, {
      "id": "0009",
      "title": "Hot Dog",
      "ingredients": ["Hot Dogs", "Cheese", "Ketchup", "Mustard"],
      "preptime": "45 Minutes",
      "description": "From summer barbecues through to Bonfire Night, hot dogs will never go out of style. Check out our super sausage recipes and find topping and sauce inspiration, including classic fried onions and next level accompaniments",
      "url":"https://www.youtube.com/watch?v=8ysR2UnkAhM"
    }
    ]
}
